; domain
(define (domain wumpus_world)
    (:requirements :strips :typing)
    (:types pos crate wumpus arrow firework halfcrate pit) ; Define types for positions and crates
    (:predicates
        (agent-at ?pos - pos) ; Agent is at a position
        (crate-at ?crate - crate ?pos - pos) ; Crate is at a position
        (path ?from - pos ?to - pos) ; Path exists between positions
        (outside ?pos - pos) ; Position is outside the map (goal positions)
        (empty ?pos - pos) ; Position is empty
        (is_same_line ?pos1 - pos ?pos2 - pos) ; True if pos1 and pos2 are on the same line
        (wumpus-at ?wumpus - wumpus ?pos - pos);
        (arrow-at ?arrow - arrow ?pos - pos);
        (has-arrow);
        (firework-at ?firework - firework ?pos - pos);
        (walkable ?pos - pos); position is walkable
        (halfcrate-at ?halfcrate - halfcrate ?pos - pos);
        (firework-count-0);
        (firework-count-1);
        (firework-count-2);
        (firework-count-3);
        (pit-at ?pit - pit ?pos - pos) ; Predicate to represent the presence of a pit
        (filled ?pit - pit) ; Predicate to represent a filled pit
        (half-filled ?pit - pit) ; Predicate to represent a half-filled pit
        (empty-pit ?pit - pit)
    )

(:action move_firework
    :parameters (?from - pos ?to - pos ?firework - firework)
    :precondition (and 
        (agent-at ?from) 
        (path ?from ?to) 
        (firework-at ?firework ?to)
        (or (firework-count-0) (firework-count-1)(firework-count-2))
        (walkable ?to)
    )
    :effect (and 
        (not (agent-at ?from)) 
        (agent-at ?to)
        (not (firework-at ?firework ?to))
        (when (firework-count-0) (and (not (firework-count-0)) (firework-count-1)))
        (when (firework-count-1) (and (not (firework-count-1)) (firework-count-2)))
        (when (firework-count-2) (and (not (firework-count-2)) (firework-count-3)))
        (empty ?from)
        (walkable ?from)
    )
)

(:action move_arrow
    :parameters (?from - pos ?to - pos ?arrow - arrow)
    :precondition (and 
        (agent-at ?from) 
        (path ?from ?to) 
        (and (arrow-at ?arrow ?to) (not (has-arrow)))
        (walkable ?to)
        
    )
    :effect (and 

        (not (agent-at ?from)) 
        (agent-at ?to)
        (not (arrow-at ?arrow ?to))
        (has-arrow)
        (empty ?from)
        (walkable ?from)

    )
)

  (:action move
        :parameters (?from - pos ?to - pos)
        :precondition (and 
            (agent-at ?from) 
            (path ?from ?to) 
            (empty ?to)
            (walkable ?to)
        )
        :effect (and 
            (not (agent-at ?from)) 
            (agent-at ?to)
            (not (empty ?to)) 
            (empty ?from)
            (walkable ?from)
        )
    )

  (:action move_walkable
        :parameters (?from - pos ?to - pos)
        :precondition (and 
            (agent-at ?from) 
            (path ?from ?to) 
            (walkable ?to)
            (not (empty ?to))
        )
        :effect (and 
            (not (agent-at ?from)) 
            (agent-at ?to)
            (not (empty ?to)) 
            (walkable ?from)
        )
    )

    (:action push
        :parameters (?agent - pos ?from - pos ?to - pos ?crate - crate)
        :precondition (and 
            (agent-at ?agent) 
            (crate-at ?crate ?from) 
            (path ?agent ?from) 
            (path ?from ?to) 
            (empty ?to)
            (not (outside ?to))
            (is_same_line ?agent ?to) ; Ensure from and to are on the same line
        )

        :effect (and 
            (not (agent-at ?agent)) 
            (agent-at ?from) 
            (not (crate-at ?crate ?from)) 
            (crate-at ?crate ?to) 
            (empty ?agent) 
            (not (empty ?to))
            (walkable ?from)
            (not (walkable ?to))
        )
    )

          (:action push_halfcrate
        :parameters (?agent - pos ?from - pos ?to - pos ?halfcrate - halfcrate)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (empty ?to)
            (not (outside ?to))
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (halfcrate-at ?halfcrate ?from))
            (halfcrate-at ?halfcrate ?to)
            (empty ?agent)
            (not (empty ?to))
            (walkable ?from)
            (not (walkable ?to))
        )
    )

    (:action push_two_halfcrates
        :parameters (?agent - pos ?from1 - pos ?from2 - pos ?to - pos ?halfcrate1 - halfcrate ?halfcrate2 - halfcrate)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate1 ?from1)
            (halfcrate-at ?halfcrate2 ?from2)
            (path ?agent ?from1)
            (path ?from1 ?from2)
            (path ?from2 ?to)
            (empty ?to)
            (not (outside ?to))
            (is_same_line ?agent ?to)
            (is_same_line ?agent ?from2)
            (is_same_line ?agent ?from1)
            (walkable ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from1)
            (not (halfcrate-at ?halfcrate1 ?from1))
            (halfcrate-at ?halfcrate1 ?from2)
            (not (halfcrate-at ?halfcrate2 ?from2))
            (halfcrate-at ?halfcrate2 ?to)
            (empty ?agent)
            (not (empty ?to))
            (not (empty ?from2))
            (walkable ?from1)
            (not (walkable ?from2))
            (not (walkable ?to))
        )
    )


    (:action shoot
    :parameters (?from - pos ?to - pos ?wumpus - wumpus)
    :precondition (and 
        (agent-at ?from) 
        (wumpus-at ?wumpus ?to) 
        (has-arrow)
        (path ?from ?to) ; Assumes a direct line of sight from the agent to the Wumpus
    )

    :effect (and 
        (not (wumpus-at ?wumpus ?to)) ; The Wumpus is eliminated
        (not (has-arrow)) ; The agent uses the arrow
        (empty ?to) ; Explicitly mark the position as empty
        (walkable ?to);
    )
)
    (:action scare
        :parameters (?agent - pos ?from - pos ?to - pos ?wumpus - wumpus)
        :precondition (and 
            (agent-at ?agent)
            (not (agent-at ?from)) 
            (wumpus-at ?wumpus ?from) 
            (path ?agent ?from) 
            (path ?from ?to) 
            (or (firework-count-1) (firework-count-2)(firework-count-3))
            (walkable ?to)
            (not (outside ?to))
            (is_same_line ?agent ?to) ; Ensure from and to are on the same line
        )

        :effect (and 
            (agent-at ?agent)
            (not (wumpus-at ?wumpus ?from)) 
            (wumpus-at ?wumpus ?to) 
            (empty ?from)
            (not (empty ?to))
            (walkable ?from)
            (not (walkable ?to))
            (when (firework-count-3) (and (not(firework-count-3))(firework-count-2)))
            (when (firework-count-2) (and (not(firework-count-2))(firework-count-1)))
            (when (firework-count-1) (and (not(firework-count-1))(firework-count-0)))
        )
    )

    (:action push_crate_into_empty_pit
        :parameters (?agent - pos ?from - pos ?to - pos ?crate - crate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (crate-at ?crate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (pit-at ?pit ?to)
            (empty-pit ?pit)
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (crate-at ?crate ?from))
            (walkable ?from)
            (walkable ?to)
            (filled ?pit)
            (not (empty-pit ?pit))
            (empty ?agent)

        )
    )

    (:action push_halfcrate_into_empty_pit
        :parameters (?agent - pos ?from - pos ?to - pos ?halfcrate - halfcrate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (pit-at ?pit ?to)
            (empty-pit ?pit)
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (halfcrate-at ?halfcrate ?from))
            (half-filled ?pit)
            (not (empty-pit ?pit))
            (empty ?agent)
            (walkable ?from)
        )
    )

    (:action push_halfcrate_into_half_filled_pit
        :parameters (?agent - pos ?from - pos ?to - pos ?halfcrate - halfcrate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (pit-at ?pit ?to)
            (half-filled ?pit)
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (halfcrate-at ?halfcrate ?from))
            (filled ?pit)
            (not (half-filled ?pit))
            (empty ?agent)
            (walkable ?to)
            (walkable ?from)
        )
    )

    (:action push_crate_into_half_filled_pit
        :parameters (?agent - pos ?from - pos ?to - pos ?crate - crate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (crate-at ?crate ?from)
            (path ?agent ?from)
            (path ?from ?to)
            (pit-at ?pit ?to)
            (half-filled ?pit)
            (is_same_line ?agent ?to)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from)
            (not (crate-at ?crate ?from))
            (not (half-filled ?pit))
            (not (walkable ?to))
            (empty ?agent)
            (walkable ?from)
        )
    )

        (:action push_two_halfcrates_into_empty_pit
        :parameters (?agent - pos ?from1 - pos ?from2 - pos ?to - pos ?halfcrate1 - halfcrate ?halfcrate2 - halfcrate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate1 ?from1)
            (halfcrate-at ?halfcrate2 ?from2)
            (path ?agent ?from1)
            (path ?from1 ?from2)
            (path ?from2 ?to)
            (pit-at ?pit ?to)
            (empty-pit ?pit)
            (is_same_line ?agent ?to)
            (is_same_line ?agent ?from2)
            (is_same_line ?agent ?from1)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from1)
            (not (halfcrate-at ?halfcrate1 ?from1))
            (halfcrate-at ?halfcrate1 ?from2)
            (not (halfcrate-at ?halfcrate2 ?from2))
            (empty ?agent)
            (not (empty ?to))
            (half-filled ?pit)
            (not (empty-pit ?pit))
        )
    )

    (:action push_two_halfcrates_into_half_filled_pit
        :parameters (?agent - pos ?from1 - pos ?from2 - pos ?to - pos ?halfcrate1 - halfcrate ?halfcrate2 - halfcrate ?pit - pit)
        :precondition (and
            (agent-at ?agent)
            (halfcrate-at ?halfcrate1 ?from1)
            (halfcrate-at ?halfcrate2 ?from2)
            (path ?agent ?from1)
            (path ?from1 ?from2)
            (path ?from2 ?to)
            (pit-at ?pit ?to)
            (half-filled ?pit)
            (is_same_line ?agent ?to)
            (is_same_line ?agent ?from2)
            (is_same_line ?agent ?from1)
        )
        :effect (and
            (not (agent-at ?agent))
            (agent-at ?from1)
            (not (halfcrate-at ?halfcrate1 ?from1))
            (halfcrate-at ?halfcrate1 ?from2)
            (not (halfcrate-at ?halfcrate2 ?from2))
            (empty ?agent)
            (not (empty ?to))
            (not(half-filled ?pit))
            (filled ?pit)
            (not (empty-pit ?pit))
            (walkable ?to)
        )
    )

    )

; problem
(define (problem simple_escape)
    (:domain wumpus_world)
    (:objects
        p1_0 p5_0 p8_0 p9_0 p1_1 p5_1 p6_1 p11_1 p2_2 p3_2 p4_2 p6_2 p7_2 p7_3 p8_3 p9_3 p0_4 p3_4 p8_4 p10_4 p1_5 p3_5 p5_5 p9_5 p0_6 p2_6 p3_6 p6_6 p6_7 p10_7 p1_-1 p5_-1 p6_8 p8_-1 p9_-1 p10_8 p12_1 p-1_4 p-1_6 - pos
         - crate
         - wumpus
         - arrow
         - firework
         - halfcrate
         - pit

    )
    (:init
        (agent-at p8_4)
        (firework-count-0);
        
        (path p1_0 p1_1) (path p1_1 p1_0) (path p5_0 p5_1) (path p5_1 p5_0) (path p8_0 p9_0) (path p9_0 p8_0) (path p5_1 p6_1) (path p6_1 p5_1) (path p6_1 p6_2) (path p6_2 p6_1) (path p2_2 p3_2) (path p3_2 p2_2) (path p3_2 p4_2) (path p4_2 p3_2) (path p6_2 p7_2) (path p7_2 p6_2) (path p7_2 p7_3) (path p7_3 p7_2) (path p7_3 p8_3) (path p8_3 p7_3) (path p8_3 p9_3) (path p9_3 p8_3) (path p8_3 p8_4) (path p8_4 p8_3) (path p3_4 p3_5) (path p3_5 p3_4) (path p3_5 p3_6) (path p3_6 p3_5) (path p2_6 p3_6) (path p3_6 p2_6) (path p6_6 p6_7) (path p6_7 p6_6) (path p1_0 p1_-1) (path p5_0 p5_-1) (path p6_7 p6_8) (path p8_0 p8_-1) (path p9_0 p9_-1) (path p10_7 p10_8) (path p11_1 p12_1) (path p0_4 p-1_4) (path p0_6 p-1_6)
        
        
        
        
        (empty p1_0) (empty p5_0) (empty p8_0) (empty p9_0) (empty p1_1) (empty p5_1) (empty p6_1) (empty p11_1) (empty p2_2) (empty p3_2) (empty p4_2) (empty p6_2) (empty p7_2) (empty p7_3) (empty p8_3) (empty p9_3) (empty p0_4) (empty p3_4) (empty p10_4) (empty p1_5) (empty p3_5) (empty p5_5) (empty p9_5) (empty p0_6) (empty p2_6) (empty p3_6) (empty p6_6) (empty p6_7) (empty p10_7)
        (empty p1_-1) (empty p5_-1) (empty p6_8) (empty p8_-1) (empty p9_-1) (empty p10_8) (empty p12_1) (empty p-1_4) (empty p-1_6)
        (outside p1_-1) (outside p5_-1) (outside p6_8) (outside p8_-1) (outside p9_-1) (outside p10_8) (outside p12_1) (outside p-1_4) (outside p-1_6)
        (walkable p1_0) (walkable p5_0) (walkable p8_0) (walkable p9_0) (walkable p1_1) (walkable p5_1) (walkable p6_1) (walkable p11_1) (walkable p2_2) (walkable p3_2) (walkable p4_2) (walkable p6_2) (walkable p7_2) (walkable p7_3) (walkable p8_3) (walkable p9_3) (walkable p0_4) (walkable p3_4) (walkable p10_4) (walkable p1_5) (walkable p3_5) (walkable p5_5) (walkable p9_5) (walkable p0_6) (walkable p2_6) (walkable p3_6) (walkable p6_6) (walkable p6_7) (walkable p10_7)
        (walkable p1_-1) (walkable p5_-1) (walkable p6_8) (walkable p8_-1) (walkable p9_-1) (walkable p10_8) (walkable p12_1) (walkable p-1_4) (walkable p-1_6)
        
        
        
        
        (is_same_line p1_0 p5_0) (is_same_line p1_0 p8_0) (is_same_line p1_0 p9_0) (is_same_line p1_0 p1_1) (is_same_line p1_0 p1_5) (is_same_line p1_0 p1_-1) (is_same_line p5_0 p1_0) (is_same_line p5_0 p8_0) (is_same_line p5_0 p9_0) (is_same_line p5_0 p5_1) (is_same_line p5_0 p5_5) (is_same_line p5_0 p5_-1) (is_same_line p8_0 p1_0) (is_same_line p8_0 p5_0) (is_same_line p8_0 p9_0) (is_same_line p8_0 p8_3) (is_same_line p8_0 p8_4) (is_same_line p8_0 p8_-1) (is_same_line p9_0 p1_0) (is_same_line p9_0 p5_0) (is_same_line p9_0 p8_0) (is_same_line p9_0 p9_3) (is_same_line p9_0 p9_5) (is_same_line p9_0 p9_-1) (is_same_line p1_1 p1_0) (is_same_line p1_1 p5_1) (is_same_line p1_1 p6_1) (is_same_line p1_1 p11_1) (is_same_line p1_1 p1_5) (is_same_line p1_1 p1_-1) (is_same_line p1_1 p12_1) (is_same_line p5_1 p5_0) (is_same_line p5_1 p1_1) (is_same_line p5_1 p6_1) (is_same_line p5_1 p11_1) (is_same_line p5_1 p5_5) (is_same_line p5_1 p5_-1) (is_same_line p5_1 p12_1) (is_same_line p6_1 p1_1) (is_same_line p6_1 p5_1) (is_same_line p6_1 p11_1) (is_same_line p6_1 p6_2) (is_same_line p6_1 p6_6) (is_same_line p6_1 p6_7) (is_same_line p6_1 p6_8) (is_same_line p6_1 p12_1) (is_same_line p11_1 p1_1) (is_same_line p11_1 p5_1) (is_same_line p11_1 p6_1) (is_same_line p11_1 p12_1) (is_same_line p2_2 p3_2) (is_same_line p2_2 p4_2) (is_same_line p2_2 p6_2) (is_same_line p2_2 p7_2) (is_same_line p2_2 p2_6) (is_same_line p3_2 p2_2) (is_same_line p3_2 p4_2) (is_same_line p3_2 p6_2) (is_same_line p3_2 p7_2) (is_same_line p3_2 p3_4) (is_same_line p3_2 p3_5) (is_same_line p3_2 p3_6) (is_same_line p4_2 p2_2) (is_same_line p4_2 p3_2) (is_same_line p4_2 p6_2) (is_same_line p4_2 p7_2) (is_same_line p6_2 p6_1) (is_same_line p6_2 p2_2) (is_same_line p6_2 p3_2) (is_same_line p6_2 p4_2) (is_same_line p6_2 p7_2) (is_same_line p6_2 p6_6) (is_same_line p6_2 p6_7) (is_same_line p6_2 p6_8) (is_same_line p7_2 p2_2) (is_same_line p7_2 p3_2) (is_same_line p7_2 p4_2) (is_same_line p7_2 p6_2) (is_same_line p7_2 p7_3) (is_same_line p7_3 p7_2) (is_same_line p7_3 p8_3) (is_same_line p7_3 p9_3) (is_same_line p8_3 p8_0) (is_same_line p8_3 p7_3) (is_same_line p8_3 p9_3) (is_same_line p8_3 p8_4) (is_same_line p8_3 p8_-1) (is_same_line p9_3 p9_0) (is_same_line p9_3 p7_3) (is_same_line p9_3 p8_3) (is_same_line p9_3 p9_5) (is_same_line p9_3 p9_-1) (is_same_line p0_4 p3_4) (is_same_line p0_4 p8_4) (is_same_line p0_4 p10_4) (is_same_line p0_4 p0_6) (is_same_line p0_4 p-1_4) (is_same_line p3_4 p3_2) (is_same_line p3_4 p0_4) (is_same_line p3_4 p8_4) (is_same_line p3_4 p10_4) (is_same_line p3_4 p3_5) (is_same_line p3_4 p3_6) (is_same_line p3_4 p-1_4) (is_same_line p8_4 p8_0) (is_same_line p8_4 p8_3) (is_same_line p8_4 p0_4) (is_same_line p8_4 p3_4) (is_same_line p8_4 p10_4) (is_same_line p8_4 p8_-1) (is_same_line p8_4 p-1_4) (is_same_line p10_4 p0_4) (is_same_line p10_4 p3_4) (is_same_line p10_4 p8_4) (is_same_line p10_4 p10_7) (is_same_line p10_4 p10_8) (is_same_line p10_4 p-1_4) (is_same_line p1_5 p1_0) (is_same_line p1_5 p1_1) (is_same_line p1_5 p3_5) (is_same_line p1_5 p5_5) (is_same_line p1_5 p9_5) (is_same_line p1_5 p1_-1) (is_same_line p3_5 p3_2) (is_same_line p3_5 p3_4) (is_same_line p3_5 p1_5) (is_same_line p3_5 p5_5) (is_same_line p3_5 p9_5) (is_same_line p3_5 p3_6) (is_same_line p5_5 p5_0) (is_same_line p5_5 p5_1) (is_same_line p5_5 p1_5) (is_same_line p5_5 p3_5) (is_same_line p5_5 p9_5) (is_same_line p5_5 p5_-1) (is_same_line p9_5 p9_0) (is_same_line p9_5 p9_3) (is_same_line p9_5 p1_5) (is_same_line p9_5 p3_5) (is_same_line p9_5 p5_5) (is_same_line p9_5 p9_-1) (is_same_line p0_6 p0_4) (is_same_line p0_6 p2_6) (is_same_line p0_6 p3_6) (is_same_line p0_6 p6_6) (is_same_line p0_6 p-1_6) (is_same_line p2_6 p2_2) (is_same_line p2_6 p0_6) (is_same_line p2_6 p3_6) (is_same_line p2_6 p6_6) (is_same_line p2_6 p-1_6) (is_same_line p3_6 p3_2) (is_same_line p3_6 p3_4) (is_same_line p3_6 p3_5) (is_same_line p3_6 p0_6) (is_same_line p3_6 p2_6) (is_same_line p3_6 p6_6) (is_same_line p3_6 p-1_6) (is_same_line p6_6 p6_1) (is_same_line p6_6 p6_2) (is_same_line p6_6 p0_6) (is_same_line p6_6 p2_6) (is_same_line p6_6 p3_6) (is_same_line p6_6 p6_7) (is_same_line p6_6 p6_8) (is_same_line p6_6 p-1_6) (is_same_line p6_7 p6_1) (is_same_line p6_7 p6_2) (is_same_line p6_7 p6_6) (is_same_line p6_7 p10_7) (is_same_line p6_7 p6_8) (is_same_line p10_7 p10_4) (is_same_line p10_7 p6_7) (is_same_line p10_7 p10_8) (is_same_line p1_-1 p1_0) (is_same_line p1_-1 p1_1) (is_same_line p1_-1 p1_5) (is_same_line p1_-1 p5_-1) (is_same_line p1_-1 p8_-1) (is_same_line p1_-1 p9_-1) (is_same_line p5_-1 p5_0) (is_same_line p5_-1 p5_1) (is_same_line p5_-1 p5_5) (is_same_line p5_-1 p1_-1) (is_same_line p5_-1 p8_-1) (is_same_line p5_-1 p9_-1) (is_same_line p6_8 p6_1) (is_same_line p6_8 p6_2) (is_same_line p6_8 p6_6) (is_same_line p6_8 p6_7) (is_same_line p6_8 p10_8) (is_same_line p8_-1 p8_0) (is_same_line p8_-1 p8_3) (is_same_line p8_-1 p8_4) (is_same_line p8_-1 p1_-1) (is_same_line p8_-1 p5_-1) (is_same_line p8_-1 p9_-1) (is_same_line p9_-1 p9_0) (is_same_line p9_-1 p9_3) (is_same_line p9_-1 p9_5) (is_same_line p9_-1 p1_-1) (is_same_line p9_-1 p5_-1) (is_same_line p9_-1 p8_-1) (is_same_line p10_8 p10_4) (is_same_line p10_8 p10_7) (is_same_line p10_8 p6_8) (is_same_line p12_1 p1_1) (is_same_line p12_1 p5_1) (is_same_line p12_1 p6_1) (is_same_line p12_1 p11_1) (is_same_line p-1_4 p0_4) (is_same_line p-1_4 p3_4) (is_same_line p-1_4 p8_4) (is_same_line p-1_4 p10_4) (is_same_line p-1_4 p-1_6) (is_same_line p-1_6 p0_6) (is_same_line p-1_6 p2_6) (is_same_line p-1_6 p3_6) (is_same_line p-1_6 p6_6) (is_same_line p-1_6 p-1_4)
    )
    (:goal
        (or (agent-at p1_-1) (agent-at p5_-1) (agent-at p6_8) (agent-at p8_-1) (agent-at p9_-1) (agent-at p10_8) (agent-at p12_1) (agent-at p-1_4) (agent-at p-1_6))
    )
)

; plan
1. (move p8_4 p8_3)
   deleted: (agent-at p8_4) (empty p8_3)
   added: (agent-at p8_3) (empty p8_4) (walkable p8_4)
   goals met: 0 of 1
2. (move p8_3 p7_3)
   deleted: (agent-at p8_3) (empty p7_3)
   added: (agent-at p7_3) (empty p8_3)
   goals met: 0 of 1
3. (move p7_3 p7_2)
   deleted: (agent-at p7_3) (empty p7_2)
   added: (agent-at p7_2) (empty p7_3)
   goals met: 0 of 1
4. (move p7_2 p6_2)
   deleted: (agent-at p7_2) (empty p6_2)
   added: (agent-at p6_2) (empty p7_2)
   goals met: 0 of 1
5. (move p6_2 p6_1)
   deleted: (agent-at p6_2) (empty p6_1)
   added: (agent-at p6_1) (empty p6_2)
   goals met: 0 of 1
6. (move p6_1 p5_1)
   deleted: (agent-at p6_1) (empty p5_1)
   added: (agent-at p5_1) (empty p6_1)
   goals met: 0 of 1
7. (move p5_1 p5_0)
   deleted: (agent-at p5_1) (empty p5_0)
   added: (agent-at p5_0) (empty p5_1)
   goals met: 0 of 1
8. (move p5_0 p5_-1)
   deleted: (agent-at p5_0) (empty p5_-1)
   added: (agent-at p5_-1) (empty p5_0)
   goals met: 1 of 1
